a=5
b=5.89
c = 'Hello'
print(f"{a} - {b} - {c}")
#print("{} - {} - {}".format(a,b,c))
# -----------------------------------------------
# print('Введите первое число: ')             //  можно так
# a = int(input())      //     ввод в консоль
# b = int(input('Введите второе число: '))      // можно так
# print(a, ' + ', b, ' = ', a + b)
#---------------------------------------------------
# c = 1
# print(c)
# print(type(c))
# c = bool(c)
# print(c)
# print(type(c))
#--------------------------------------------------
# v = 'fghf' строка   //  Так нельзя
# v = int(v)  число
# --------------------------------------------------
# a = 5.7898
# b = 6.54645  //класс float
# print(round(a*b, 3))    //   round - ( , 3) функция знаки после запятой. 3 - 3 знака
# ------------------------------------------------------------------------------
# iter = 2
# iter += 3 # iter = iter + 3
# iter -= 4 # iter = iter - 4
# iter *= 5 # iter = iter * 5
# iter /= 5 # iter = iter / 5
# iter //= 5 # iter = iter // 5
# iter %= 5 # iter = iter % 5
# iter **= 5 # iter = iter ** 5   // 5-я степень
#-------------------------------------------------------------------------------
# a = 1 > 4
# print(a)      // false
#a = 1 < 4 and 5 >
#print(a)       // true
#a = 1 == 2
#print(a)       // false
#a = 1 != 2
#print(a)         // true
#a = 'dfg'
#b = 'dfg'
#print(a == b)      // true
#a = 1 < 3 < 5 < 10
#print(a)           // true
#-------------------------------------------------------------------------------
# username = input('Введите Ваше имя: ')
# if username == 'Игорь':
#     print('Ура, это же ИИИГОООРЬ!')
# elif username == 'Света':
#     print('Я так ждал вас, Света!')
# elif username == 'Саша':
#     print('Ну наконец то, это Саша')
# else:
#     print('Привет,', username)
#------------------------------------------------------------------------
# i = 0
# while i < 5:
#     if i == 3:
#         break     // лучше не использовать
#     i = i + 1
# else:
#     print('Пожалуй')
#     print('хватит')
# print(i)
#--------------------------------------------------------------------------
# a = 'qwerty'     // строка

# for i in a:     // i - индекс
#     print(i)
#-------------------------------------------------------------------------
# line = ""
# for i in range(5):
#     line = ""
#     for j in range(5):
#         line += "+"
#     print(line)
#----------------------------------------------------------------------------
# text = 'съешь еще этих мягких французских булок'       # пробелы считаются тоже
# print(text[0])                                         #  c
# print(text[1])                                         #  ъ
# print(text[len(text) - 1])                             #  к
# print(text[-5])                                        #  б
# print(text[:])     # съешь еще этих мягких французских булок
# print(text[:2])                                        #  съ
# print(text[len(text) - 2:])                           #  ок
# print(text[2:9])                                       # ешь еще
# print(text[6:18])                                   # еще этих мягких
# print(text[0:len(text):6])                           # сеикакл
# print(text[::6])                                     # сеикакл
# text = text[2:9] + text[-5] + text[:2]        # ешь ещебсь
#----------------------------------------------------------------------------

# n = 123
# summa = 0
# while n > 0:
#     x = n % 10
#     summa = summa + x
#     n = n // 10
# print(summa)