# Задача 2: Найдите сумму цифр трехзначного числа.
#n = 123 -> res = 6 (1 + 2 + 3)
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
n = 100
sum = 0
while n > 0:
    a = n % 10
    sum = sum + a
    n = n // 10
res = sum
print(res)
