# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?
n = 60
A = 0         # B = n//6
B = 0            
A = n // 6    
B = (A + A) * 2  # (n//6)* 4 
C = A         # C = n//6
print(A, B, C)
