# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)
n = 123
res = 0
while n > 0:
    a = n % 10
    res = res + a
    n = n // 10
print(res)